In [3]:
import pandas as pd
import numpy as np

# Create Series

In [5]:
s1 = pd.Series([10,20,30,1])
s1

0    10
1    20
2    30
3     1
dtype: int64

In [8]:
s2 = pd.Series(['apple','mango','orange'],index = ['a','b','c'])
s2

a     apple
b     mango
c    orange
dtype: object

# Create Series using Numpy

In [12]:
s1 = pd.Series(np.array([1,2,3,4,8,5,5,7]))
s1 =  pd.Series(np.arange(10))
s1

0    0
1    1
2    2
3    3
4    4
5    5
6    6
7    7
8    8
9    9
dtype: int32

In [19]:
s1 =  pd.Series(np.ones(5))
s1 =  pd.Series(np.zeros(5))
s1 =  pd.Series(np.ones(5) *5)
s1

0    5.0
1    5.0
2    5.0
3    5.0
4    5.0
dtype: float64

In [22]:
# Creation of Series using Dictionary
data = {"id" : 101,"name" : "Amit","city" :"mumbai","mobile" : 989925014}
s1 =  pd.Series(data)
s1

id              101
name           Amit
city         mumbai
mobile    989925014
dtype: object

# Accessing element of Series

In [24]:
s1 = pd.Series([10,20,30], index = ['a','b','c'])
s1

a    10
b    20
c    30
dtype: int64

In [27]:
s1['a']

10

In [30]:
s2 = pd.Series([2,5,6,7], index = ['a','b','c','d'])
s2

a    2
b    5
c    6
d    7
dtype: int64

In [33]:
# s2[['b','c']]
s2[['a','d']]

a    2
d    7
dtype: int64

In [37]:
s1 = pd.Series(np.arange(10,20))
s1

0    10
1    11
2    12
3    13
4    14
5    15
6    16
7    17
8    18
9    19
dtype: int32

In [39]:
s1[1:5]

1    11
2    12
3    13
4    14
dtype: int32

In [41]:
s1[0:4]

0    10
1    11
2    12
3    13
dtype: int32

In [42]:
# Property of Series

In [47]:
s1.name = "Test-A"
print(s1.name)

Test-A

In [52]:
s1.index.name = 'indx'
print(s1.index.name)

indx

In [54]:
s1

indx
0    10
1    11
2    12
3    13
4    14
5    15
6    16
7    17
8    18
9    19
Name: Test-A, dtype: int32

In [58]:
# Check Series size
s1.size

10

In [59]:
s1.empty

False

In [62]:
s1_emp = pd.Series()
s1_emp.empty

C:\Users\LENOVO\AppData\Local\Temp\ipykernel_8964\3339574591.py:1: FutureWarning: The default dtype for empty Series will be 'object' instead of 'float64' in a future version. Specify a dtype explicitly to silence this warning.
  s1_emp = pd.Series()

True

# Some Methods of Series

In [67]:
s1 = pd.Series(np.random.randint(50,100,50))

In [73]:
# Head Method
s1.head(10)
# print(s1.size)

0    72
1    90
2    64
3    63
4    68
5    98
6    68
7    80
8    67
9    89
dtype: int32

In [76]:
# tail
s1.tail(5)

45    80
46    60
47    79
48    74
49    96
dtype: int32

In [78]:
# Count
s1.count()

50

In [79]:
# Mathmatical Operation

In [81]:
a1 = pd.Series(np.random.randint(1,10,5))
a2 = pd.Series(np.random.randint(11,20,5))
a1

0    7
1    6
2    1
3    5
4    5
dtype: int32

In [83]:
a2

0    19
1    16
2    18
3    12
4    11
dtype: int32

In [84]:
# Addition

In [85]:
a1+a2

0    26
1    22
2    19
3    17
4    16
dtype: int32

In [87]:
a1-a2

0   -12
1   -10
2   -17
3    -7
4    -6
dtype: int32

In [93]:
s1 = pd.Series([1,2,3,4,5], index = ['a','b','c','d','e'])
s1

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [92]:
s2 = pd.Series([10,20,-10,-50,100], index = list('xyace'))
s2

x     10
y     20
a    -10
c    -50
e    100
dtype: int64

In [95]:
s1+s2

a     -9.0
b      NaN
c    -47.0
d      NaN
e    105.0
x      NaN
y      NaN
dtype: float64

In [97]:
s1-s2

a    11.0
b     NaN
c    53.0
d     NaN
e   -95.0
x     NaN
y     NaN
dtype: float64

In [99]:
# Other Method
s1.add(s2, fill_value = 1)

a     -9.0
b      3.0
c    -47.0
d      5.0
e    105.0
x     11.0
y     21.0
dtype: float64

In [102]:
# s1.sub(s2, fill_value = 0)
s1.mul(s2, fill_value = 0)

a    -10.0
b      0.0
c   -150.0
d      0.0
e    500.0
x      0.0
y      0.0
dtype: float64

## Creation of Dataframe

In [106]:
df_empty = pd.DataFrame()
print(df_empty)

Empty DataFrame
Columns: []
Index: []

### Cteate data fram using Numpy array

In [108]:
# Cteate data fram using Numpy array
arr1 = np.array([10,20,30])
arr2 = np.array([11,12,13])
arr3 = np.array([40,50,60])

In [112]:
dataframe1 = pd.DataFrame(arr1)
print(dataframe1)

    0
0  10
1  20
2  30

In [114]:
dataframe1 = pd.DataFrame([arr1,arr2,arr3])
dataframe1

    0   1   2
0  10  20  30
1  11  12  13
2  40  50  60

In [116]:
dataframe1.columns = ['A','B','C']
dataframe1

    A   B   C
0  10  20  30
1  11  12  13
2  40  50  60

## Create Dataframe uising List of Dictionary

In [118]:
list_dict = [
    {"id" : 101,"name":"apple","price":150,"city" :"meerut"},
     {"id" : 102,"name":"orange","price":250,"city" :"kanpur"},
     {"id" : 103,"name":"mango","price":99,"city" :"mumbai"},
     {"id" : 104,"name":"date","price":120,"city" :"kolkata"},
]
data_fr = pd.DataFrame(list_dict)
data_fr

    id    name  price     city
0  101   apple    150   meerut
1  102  orange    250   kanpur
2  103   mango     99   mumbai
3  104    date    120  kolkata

### Creation of DataFrame using Dictionary of list

In [125]:
dict_list = {
    "id" : [101,102,103,104],
    "name" : ["apple","orange","mango","date"],
    "price" : [150,250,99,120],
    "city" : ["meerut","kanpur","mumbai","Kolkata"]
}
data =  pd.DataFrame(dict_list)
data

    id    name  price     city
0  101   apple    150   meerut
1  102  orange    250   kanpur
2  103   mango     99   mumbai
3  104    date    120  Kolkata

## Crerate Dataframe using Series

In [128]:
s1 = pd.Series([10,20,30])
s2 = pd.Series(["mango","orange","apple"])
s3 = pd.Series([150,220,360])
data = pd.DataFrame([s1,s2,s3])
data

       0       1      2
0     10      20     30
1  mango  orange  apple
2    150     220    360

In [131]:
s1 = pd.Series([10,20,30])
s2 = pd.Series(["mango","orange","apple"])
s3 = pd.Series([150,220,360])
data = pd.DataFrame({"id" : s1,"name" :s2,"price":s3})
data

   id    name  price
0  10   mango    150
1  20  orange    220
2  30   apple    360

# head and tail to disoplay pandas data frame

In [135]:
data_fr.head(2)

    id    name  price    city
0  101   apple    150  meerut
1  102  orange    250  kanpur

In [136]:
data_fr.tail(2)

    id   name  price     city
2  103  mango     99   mumbai
3  104   date    120  kolkata